Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: You can edit all configuration files to further define any particular build environment. This process is represented by the "User Configuration Edits" box in the figure.
it_it: È possibile modificare tutti i file di configurazione per definire ulteriormente un ambiente di compilazione specifico. Questo processo è rappresentato dal riquadro "User Configuration Edits" nella figura.

source: You can enable any number of events or complete subsystems (by using the ``enable`` file in the subsystem directory) and get an arbitrarily fine-grained idea of what's going on in the system by enabling as many of the appropriate tracepoints as applicable.
it_it: È possibile abilitare un numero qualsiasi di eventi o sottosistemi completi (utilizzando il file ``enable`` nella directory del sottosistema) e ottenere un'idea estremamente dettagliata di ciò che accade nel sistema abilitando tutti i tracepoint appropriati.

source: You can find a list of the combined SPDX and OSI licenses that the Yocto Project uses in the :oe_git:`meta/files/common-licenses </openembedded-core/tree/meta/files/common-licenses>` directory in :term:`OpenEmbedded-Core (OE-Core)`.
it_it: È possibile trovare un elenco delle licenze SPDX e OSI utilizzate dallo Yocto Project nella directory :oe_git:`meta/files/common-licenses </openembedded-core/tree/meta/files/common-licenses>` all'interno di :term:`OpenEmbedded-Core (OE-Core)`.

source: You can find all these branches in the :ref:`overview-manual/development-environment:yocto project source repositories`.
it_it: È possibile trovare tutti questi rami in :ref:`overview-manual/development-environment:yocto project source repositories`.

source: You can find general Git information on how to push a change upstream in the `Git Community Book <https://git-scm.com/book/en/v2/Distributed-Git-Distributed-Workflows>`__.
it_it: Si possono trovare informazioni generali su Git e su come inviare una modifica upstream nel `Git Community Book <https://git-scm.com/book/en/v2/Distributed-Git-Distributed-Workflows>`__.

source: You can find more information on adding layers in the :ref:`dev-manual/layers:adding a layer using the \`\`bitbake-layers\`\` script` section.
it_it: Si possono trovare maggiori informazioni sull'aggiunta di layer nella sezione :ref:`dev-manual/layers:adding a layer using the \`\`bitbake-layers\`\` script`.

source: You can find more information on what your append file should contain in the ":ref:`kernel-dev/common:creating the append file`" section in the Yocto Project Linux Kernel Development Manual.
it_it: Ulteriori informazioni sul contenuto del file di append sono disponibili nella sezione ":ref:`kernel-dev/common:creating the append file`" del Manuale di Sviluppo del Kernel Linux di Yocto Project.

source: You can find the Matchbox source in the Yocto Project :yocto_git:`Source Repositories <>`.
it_it: È possibile trovare il codice sorgente di Matchbox in Yocto Project :yocto_git:`Source Repositories <>`.

source: You can find the opkg source in the Yocto Project :yocto_git:`Source Repositories <>`.
it_it: È possibile trovare il codice sorgente di opkg nei repository di Yocto Project :yocto_git:`Source Repositories <>`.

source: You can find the primary LTTng Documentation on the `LTTng Documentation <https://lttng.org/docs/>`__ site. The documentation on this site is appropriate for intermediate to advanced software developers who are working in a Linux environment and are interested in efficient software tracing.
it_it: La documentazione principale di LTTng è disponibile sul sito `LTTng Documentation <https://lttng.org/docs/>`__. La documentazione su questo sito è adatta a sviluppatori software di livello intermedio e avanzato che lavorano in un ambiente Linux e sono interessati a un tracing efficiente del software.

source: You can find these files in the BSP Layer at::
it_it: È possibile trovare questi file nel layer BSP al seguente path::

source: You can find this file in the BSP Layer at::
it_it: È possibile trovare questo file nel layer BSP al seguente path::

source: You can learn more about BitBake in the :doc:`BitBake User Manual <bitbake:index>`.
it_it: Per ulteriori informazioni su BitBake, consultare il :doc:`Manuale Utente di BitBake <bitbake:index>`.

source: You can learn more about the AutoBuilder used by the Yocto Project Autobuilder :doc:`here </test-manual/understand-autobuilder>`.
it_it: Per saperne di più sull'AutoBuilder utilizzato da Yocto Project, consultare la documentazione :doc:`qui </test-manual/understand-autobuilder>`.

source: You can make sure this file is only owned by you and not readable by another user with:
it_it: Ci si può assicurare che questo file sia di proprietà e non leggibile da altri utenti con:

source: You can now open up a browser and start using Toaster.
it_it: Ora si può aprire un browser e iniziare a usare Toaster.

source: You can now run your builds from the command line, or with Toaster as explained in section ":ref:`toaster-manual/setup-and-use:using the toaster web interface`".
it_it: È ora possibile eseguire le build dalla riga di comando o tramite Toaster, come spiegato nella sezione ":ref:`toaster-manual/setup-and-use:using the toaster web interface`".

source: You can now safely destroy the trace session (note that this doesn't delete the trace --- it's still there in ``~/lttng-traces``)::
it_it: Ora si può terminare la sessione di traccia in modo sicuro (notare che questo non elimina la traccia, che rimane comunque presente in ``~/lttng-traces``)::

source: You can now view the trace in text form on the target::
it_it: Ora si può visualizzare la traccia in formato testuale sul target::

source: You can override other default project values by adding additional Toaster Setting sections such as any of the settings coming from the ``settings.xml`` file. Also, you can add custom values that are included in the BitBake environment. The "pk" values must be unique. By convention, values that set default project values have a "DEFCONF" prefix.
it_it: È possibile sovrascrivere altri valori di default del progetto aggiungendo ulteriori sezioni di Toaster Setting, come ad esempio le impostazioni provenienti dal file ``settings.xml``. È inoltre possibile aggiungere valori personalizzati inclusi nell'ambiente BitBake. I valori "pk" devono essere univoci. Per convenzione, i valori che definiscono i valori predefiniti del progetto hanno il prefisso "DEFCONF".

source: You can prevent that by setting the :term:`INHIBIT_PACKAGE_STRIP` variable to "1" in your :ref:`structure-build-conf-local.conf` when you build the image::
it_it: È possibile evitarlo impostando la variabile :term:`INHIBIT_PACKAGE_STRIP` su "1" nel file :ref:`structure-build-conf-local.conf` durante la creazione dell'immagine::

source: You can read about the ``devtool`` workflow in the Yocto Project Application Development and Extensible Software Development Kit (eSDK) Manual in the ":ref:`sdk-manual/extensible:using \`\`devtool\`\` in your sdk workflow`" section.
it_it: Si può leggere sul workflow di ``devtool`` nel Manuale di Sviluppo di Applicazioni Yocto Project e Software Development Kit (eSDK) nella sezione ":ref:`sdk-manual/extensible:using \`\`devtool\`\` in your sdk workflow`".

source: You can read more about Pseudo in the ":ref:`overview-manual/concepts:fakeroot and pseudo`" section.
it_it: Si possono trovare maggiori informazioni su Pseudo nella sezione ":ref:`overview-manual/concepts:fakeroot and pseudo`".

source: You can see how the :term:`TEMPLATECONF` variable is defined by the ``scripts/oe-setup-builddir`` script in :term:`OpenEmbedded-Core (OE-Core)`.
it_it: È possibile visualizzare come la variabile :term:`TEMPLATECONF` viene definita dallo script ``scripts/oe-setup-builddir`` in :term:`OpenEmbedded-Core (OE-Core)`.

source: You can see how the :term:`TEMPLATECONF` variable is used by looking at the ``layers/openembedded-core/scripts/oe-setup-builddir`` script in :term:`OpenEmbedded-Core (OE-Core)`.
it_it: È possibile vedere come viene utilizzata la variabile :term:`TEMPLATECONF` esaminando lo script ``layers/openembedded-core/scripts/oe-setup-builddir`` in :term:`OpenEmbedded-Core (OE-Core)`.

source: You can see the Metadata in the ``meta`` directory of the Yocto Project :yocto_git:`Source Repositories <>`.
it_it: È possibile visualizzare i metadati nella directory ``meta`` del :yocto_git:`Source Repositories <>` di Yocto Project.

source: You can set Toaster up to run as a local instance or as a shared hosted service.
it_it: È possibile configurare Toaster per l'esecuzione come istanza locale o come servizio condiviso [shared].

source: You can significantly speed up your build and guard against fetcher failures by using :ref:`overview-manual/concepts:shared state cache` mirrors and enabling :ref:`overview-manual/concepts:hash equivalence`. This way, you can use pre-built artifacts rather than building them. This is relevant only when your network and the server that you use can download these artifacts faster than you would be able to build them.
it_it: È possibile velocizzare significativamente la compilazione e proteggersi dagli errori del fetcher utilizzando i mirror :ref:`overview-manual/concepts:shared state cache` e abilitando :ref:`overview-manual/concepts:hash equivalence`. Ciò è rilevante solo se la rete e il server utilizzati possono scaricare questi artefatti più velocemente di quanto sarebbe possibile crearli.

source: You can start a Toaster environment with the "New Projects" feature disabled. Doing so is useful for the following:
it_it: È possibile avviare un ambiente Toaster con la funzione "New Projects" disabilitata. Questa opzione è utile per i seguenti scopi:

source: You can start a Toaster environment without starting its web server. This is useful for the following:
it_it: È possibile avviare un ambiente Toaster senza avviare il relativo server web. Questo è utile per i seguenti scopi:

source: You can take some steps that are specific to the OpenEmbedded build system to make your images more secure:
it_it: È possibile adottare alcune misure specifiche per il sistema di build OpenEmbedded per rendere le immagini più sicure:

source: You can use a production instance of Toaster to share the Toaster instance with remote users, multiple users, or both. The production instance is also the setup that can handle heavier loads on the web service. Use the instructions in the following sections to set up Toaster to run builds through the Toaster web interface.
it_it: Si può usare un'istanza di produzione di Toaster per condividerla con utenti remoti, più utenti o entrambi. L'istanza di produzione è anche la configurazione in grado di gestire carichi di lavoro più elevati sul servizio web. Seguire le istruzioni nelle sezioni seguenti per configurare Toaster ed eseguire le build tramite l'interfaccia web di Toaster.

source: You can use the Django administration interface to set Toaster configuration parameters such as the :term:`Build Directory`, layer sources, default variable values, and BitBake versions.
it_it: Si può usare l'interfaccia di amministrazione di Django per impostare i parametri di configurazione di Toaster, come la :term:`Build Directory`, le sorgenti dei layer, i valori di default delle variabili e le versioni di BitBake.

source: You can use the OpenEmbedded build system to build an installer for the relocatable SDK used to develop applications. When you run the installer, it installs the toolchain, which contains the development tools (e.g., ``gcc-cross-canadian``, ``clang-cross-canadian``, ``binutils-cross-canadian``, and other ``nativesdk-*`` tools), which are tools native to the SDK (i.e. native to :term:`SDK_ARCH`), you need to cross-compile and test your software. The figure shows the commands you use to easily build out this toolchain. This cross-development toolchain is built to execute on the :term:`SDKMACHINE`, which might or might not be the same machine as the Build Host.
it_it: È possibile utilizzare il sistema di build OpenEmbedded per creare un programma di installazione per l'SDK rilocabile utilizzato per sviluppare applicazioni. Quando si esegue il programma di installazione, viene installata la toolchain, che contiene gli strumenti di sviluppo (ad esempio, ``gcc-cross-canadian``, ``clang-cross-canadian``, ``binutils-cross-canadian`` e altri strumenti ``nativesdk-*``), ovvero strumenti nativi dell'SDK (ovvero nativi di :term:`SDK_ARCH`), necessari per la cross-compilazione e il test del software. La figura mostra i comandi da utilizzare per creare facilmente questa toolchain. Questa toolchain di sviluppo incrociato è progettata per essere eseguita sulla :term:`SDKMACHINE`, che potrebbe coincidere o meno con la macchina di Build Host.

source: You can use the Yocto Project instance of `Bugzilla <https://www.bugzilla.org/about/>`__ to submit a defect (bug) against BitBake, OpenEmbedded-Core, against any other Yocto Project component or for tool issues. For additional information on this implementation of Bugzilla see the ":ref:`Yocto Project Bugzilla <resources-bugtracker>`" section in the Yocto Project Reference Manual. For more detail on any of the following steps, see the Yocto Project :yocto_wiki:`Bugzilla wiki page </Bugzilla_Configuration_and_Bug_Tracking>`.
it_it: È possibile utilizzare l'istanza di `Bugzilla <https://www.bugzilla.org/about/>`__ di Yocto Project per segnalare un difetto (bug) relativo a BitBake, OpenEmbedded-Core, qualsiasi altro componente di Yocto Project o per problemi con gli strumenti. Per ulteriori informazioni su questa implementazione di Bugzilla, consultare la sezione ":ref:`Yocto Project Bugzilla <resources-bugtracker>`" nel Manuale di Riferimento di Yocto Project. Per maggiori dettagli su ciascuno dei seguenti passaggi, consultare la pagina wiki di Bugzilla di Yocto Project :yocto_wiki:`Bugzilla wiki page </Bugzilla_Configuration_and_Bug_Tracking>`.

source: You could find that some separately-licensed components that are essential for normal operation of the system might not have an unencumbered (or free) substitute. Without these essential components, the system would be non-functional. Then again, you might find that other licensed components that are simply 'good-to-have' or purely elective do have an unencumbered, free replacement component that you can use rather than agreeing to the separately-licensed component. Even for components essential to the system, you might find an unencumbered component that is not identical but will work as a less-capable version of the licensed version in the BSP recipe.
it_it: Potrebbe accadere che alcuni componenti soggetti a licenza separata, essenziali per il normale funzionamento del sistema, non abbiano un sostituto libero da vincoli (o gratuito). Senza questi componenti essenziali, il sistema risulterebbe non funzionante. D'altra parte, potrebbe accadere che altri componenti soggetti a licenza, semplicemente "desiderabili" o facoltativi, abbiano un componente sostitutivo libero da vincoli che è possibile utilizzare al posto di accettare il componente soggetto a licenza separata. Anche per i componenti essenziali al sistema, potreste trovare un componente libero, non identico ma funzionante come versione con funzionalità ridotte rispetto alla versione con licenza presente nel file BSP.

source: You could for example edit this file to limit the number of threads used by :term:`BitBake` (:term:`BB_NUMBER_THREADS`) or set the location from which you want to access downloaded files (:term:`DL_DIR`).
it_it: Ad esempio, si può modificare questo file per limitare il numero di thread utilizzati da :term:`BitBake` (:term:`BB_NUMBER_THREADS`) o impostare la posizione da cui desideri accedere ai file scaricati (:term:`DL_DIR`).

source: You could for example experiment with setting (or adding to) :term:`DISTRO_FEATURES` or :term:`IMAGE_FEATURES`, or adjust build configurations for specific recipes by setting the :term:`PACKAGECONFIG` variables for them. If you would like to publish and share changes made to this file, it is recommended to put them into a distro :term:`configuration file`, or to create layer :term:`configuration fragments <Configuration Fragment>` from changes made here.
it_it: Ad esempio, è possibile sperimentare impostando (o aggiungendo) le variabili :term:`DISTRO_FEATURES` o :term:`IMAGE_FEATURES`, oppure adattare le configurazioni di compilazione per ricette specifiche impostando le variabili :term:`PACKAGECONFIG` corrispondenti. Per pubblicare e condividere le modifiche apportate a questo file, si consiglia di inserirle in un :term:`configuration file` della distribuzione oppure di creare :term:`frammenti di configurazione <Configuration Fragment>` a partire dalle modifiche apportate qui.

source: You do not have to use a layer source to use Toaster. Tying into a layer source is optional.
it_it: Non è obbligatorio utilizzare una sorgente di layer per usare Toaster. L'integrazione con una sorgente di layer è facoltativa.

source: You may get feedback on your submitted patches from other community members or from the automated patchtest service. If issues are identified in your patches then it is usually necessary to address these before the patches are accepted into the project. In this case you should revise your commits according to the feedback and submit an updated version to the relevant mailing list.
it_it: Si potrebbe ricevere feedback sulle patch inviate da altri membri della community o dal servizio automatico di test delle patch. Se vengono identificati problemi nelle proprie patch, di solito è necessario risolverli prima che le patch vengano accettate nel progetto. In questo caso, si devono rivedere i propri commit in base al feedback e inviare una versione aggiornata alla mailing list pertinente.

source: You may use Windows Subsystem For Linux v2 to set up a build host using Windows 10 or later, or Windows Server 2019 or later, but validation is not performed against build hosts using WSL 2.
it_it: È possibile utilizzare Windows Subsystem for Linux v2 per configurare un host di build con Windows 10 o versioni successive, oppure Windows Server 2019 o versioni successive, ma la convalida non viene eseguita sugli host di build che utilizzano WSL 2.

source: You may use version 2 of Windows Subsystem For Linux (WSL 2) to set up a build host using Windows 10 or later, Windows Server 2019 or later. See the :ref:`dev-manual/start:setting up to use windows subsystem for linux (wsl 2)` section in the Yocto Project Development Tasks Manual for more information.
it_it: È possibile utilizzare la versione 2 di Windows Subsystem for Linux (WSL 2) per configurare un host di compilazione con Windows 10 o versioni successive, Windows Server 2019 o versioni successive. Per ulteriori informazioni, consultare la sezione :ref:`dev-manual/start:setting up to use windows subsystem for linux (wsl 2)` nel Manuale di Sviluppo dei Task di Yocto Project.

source: You might want to start with the build specification that :term:`Poky` provides (which is reference embedded distribution) and then add your newly-chosen layers to that. Here is the information :ref:`about adding layers <dev-manual/layers:Understanding and Creating Layers>`.
it_it: Si consiglia di iniziare con la specifica di build fornita da :term:`Poky` (la distribuzione embedded di riferimento) per poi aggiungere i layer selezionati. Queste le informazioni :ref:`sull'aggiunta dei layer <dev-manual/layers:Understanding and Creating Layers>`.

source: You must comply with all Apache, ``mod-wsgi``, and Mysql requirements.
it_it: Si devono rispettare tutti i requisiti di Apache, ``mod-wsgi`` e Mysql.

source: You must start Toaster before the build or it will not collect build data.
it_it: È necessario avviare Toaster prima della build, altrimenti non raccoglierà i dati.

source: You need a pair of public and private keys for two independent tasks:
it_it: C'è bisogno di una coppia di chiavi pubblica e privata per due attività [task] indipendenti:

source: You need to follow the prompts as the script is interactive.
it_it: È necessario seguire le istruzioni visualizzate, poiché lo script è interattivo.

source: You need to install the gitk package on your development system to use this command.
it_it: È necessario installare il pacchetto gitk sul sistema di sviluppo per utilizzare questo comando.

source: You need to install the packages that Toaster requires. Use this command::
it_it: È necessario installare i pacchetti richiesti da Toaster. Usare questo comando::

source: You need to run the ``buildslist`` command first to identify existing builds in the database before using the :ref:`toaster-manual/reference:``builddelete``` command. Here is an example that assumes default repository and :term:`Build Directory` names:
it_it: Si deve eseguire il comando ``buildslist`` prima di identificare le build esistenti nel database prima di usare il comando :ref:`toaster-manual/reference:``builddelete```. Ecco un esempio che presuppone i nomi di default per repository e della :term:`Build Directory`:

source: You need to set up a development host in order to use it with the Yocto Project. Most find that it is best to have a native Linux machine function as the development host. However, it is possible to use a system that does not run Linux as its operating system as your development host. When you have a Mac or Windows-based system, you can set it up as the development host by using an :wikipedia:`OCI container <Open_Container_Initiative>` (using `Docker <https://www.docker.com/>`__ or `Podman <https://podman.io/>`__). Once you take the steps to set up container, you effectively have access to a shell environment that is similar to what you see when using a Linux-based development host.
it_it: È necessario configurare un host di sviluppo per poterlo utilizzare con Yocto Project. Molti ritengono che sia preferibile utilizzare una macchina Linux nativa come host di sviluppo. Tuttavia, è possibile utilizzare un sistema che non esegue Linux come sistema operativo come host di sviluppo. Se si dispone di un sistema basato su Mac o Windows, è possibile configurarlo come host di sviluppo utilizzando un :wikipedia:`container OCI <Open_Container_Initiative>` (tramite `Docker <https://www.docker.com/>`__ o `Podman <https://podman.io/>`__). Una volta completata la configurazione del container, si avrà accesso a un ambiente shell simile a quello di un host di sviluppo basato su Linux.

source: You need to specify all applicable licensing files for the software. At the end of the configuration step, the build process will compare the checksums of the files to be sure the text has not changed. Any differences result in an error with the message containing the current checksum. For more explanation and examples of how to set the :term:`LIC_FILES_CHKSUM` variable, see the ":ref:`dev-manual/licenses:tracking license changes`" section.
it_it: È necessario specificare tutti i file di licenza applicabili al software. Al termine della fase di configurazione, il processo di compilazione confronterà i checksum dei file per verificare che il testo non sia cambiato. Eventuali differenze genereranno un errore con un messaggio contenente il checksum corrente. Per ulteriori spiegazioni ed esempi su come impostare la variabile :term:`LIC_FILES_CHKSUM`, consultare la sezione ":ref:`dev-manual/licenses:tracking license changes`".

source: You now have the instrumented LTTng "hello world" test program on the target, ready to test.
it_it: Ora si ha il programma di test "hello world" di LTTng strumentato sulla macchina target, pronto per essere testato.
